In [1]:
import os
import json
import random
import torch
from collections import defaultdict
from torch.utils.data import Dataset, DataLoader
from transformers import T5Tokenizer, T5ForConditionalGeneration
from difflib import get_close_matches
from tqdm import tqdm

# ======================= Dataset =========================
class TextToSQLDataset(Dataset):
    def __init__(self, pairs, tokenizer, max_input_length=512, max_output_length=128):
        self.pairs = pairs
        self.tokenizer = tokenizer
        self.max_input_length = max_input_length
        self.max_output_length = max_output_length

    def __len__(self):
        return len(self.pairs)

    def __getitem__(self, idx):
        input_text, target_text = self.pairs[idx]

        input_encoding = self.tokenizer(
            input_text,
            padding="max_length",
            truncation=True,
            max_length=self.max_input_length,
            return_tensors="pt"
        )

        target_encoding = self.tokenizer(
            target_text,
            padding="max_length",
            truncation=True,
            max_length=self.max_output_length,
            return_tensors="pt"
        )

        labels = target_encoding["input_ids"]
        labels[labels == self.tokenizer.pad_token_id] = -100

        return {
            "input_ids": input_encoding["input_ids"].squeeze(),
            "attention_mask": input_encoding["attention_mask"].squeeze(),
            "labels": labels.squeeze()
        }

# ======================= Data Utils ===========================
def load_spider_data(data_path):
    with open(os.path.join(data_path, 'train_spider.json')) as f:
        train_data = json.load(f)
    with open(os.path.join(data_path, 'train_others.json')) as f:
        train_data2 = json.load(f)
    with open(os.path.join(data_path, 'dev.json')) as f:
        dev_data = json.load(f)
    with open(os.path.join(data_path, 'tables.json')) as f:
        tables = json.load(f)
        
    train_data = train_data + train_data2
    return train_data, dev_data, tables

def split_train_val(train_data, val_ratio=0.25):
    db_to_examples = defaultdict(list)
    for ex in train_data:
        db_to_examples[ex['db_id']].append(ex)

    db_ids = list(db_to_examples.keys())
    random.shuffle(db_ids)
    split_idx = int(len(db_ids) * (1 - val_ratio))
    train_db_ids = set(db_ids[:split_idx])
    val_db_ids = set(db_ids[split_idx:])

    new_train = [ex for db in train_db_ids for ex in db_to_examples[db]]
    new_val = [ex for db in val_db_ids for ex in db_to_examples[db]]
    return new_train, new_val

def get_schema_dict(tables):
    schema_dict = {}
    for db in tables:
        db_id = db['db_id']
        table_names = db['table_names_original']
        column_names = db['column_names_original']
        columns = defaultdict(list)
        for table_idx, col_name in column_names:
            if table_idx >= 0:
                columns[table_names[table_idx]].append(col_name)
        schema_dict[db_id] = {'tables': table_names, 'columns': dict(columns)}
    return schema_dict

def serialize_schema(db_id, schema_dict):
    schema = schema_dict[db_id]
    parts = []
    for table in schema['tables']:
        cols = schema['columns'].get(table, [])
        table_str = f"[{table}] " + ", ".join(cols)
        parts.append(table_str)
    return " | ".join(parts)

def prepare_input_output(data, schema_dict):
    pairs = []
    for item in data:
        question = item['question']
        db_id = item['db_id']
        schema = serialize_schema(db_id, schema_dict)
        input_text = f"translate English to SQL: {question} <schema> {schema}"
        output_text = item['query']
        pairs.append((input_text, output_text))
    return pairs

def prepare_dataloaders(train_pairs, val_pairs, tokenizer, batch_size=8):
    train_dataset = TextToSQLDataset(train_pairs, tokenizer)
    val_dataset = TextToSQLDataset(val_pairs, tokenizer)
    train_loader = DataLoader(train_dataset, batch_size=batch_size, shuffle=True)
    val_loader = DataLoader(val_dataset, batch_size=batch_size)
    return train_loader, val_loader

# ======================= Training ========================
def train(model, train_loader, val_loader, optimizer, device, tokenizer, num_epochs=10, save_path="/kaggle/working/t5_text2sql.pt"):
    model.to(device)

    for epoch in range(num_epochs):
        model.train()
        total_train_loss = 0
        print(f"\nEpoch {epoch + 1}/{num_epochs}")
        print("-" * 30)

        for step, batch in enumerate(train_loader):
            batch = {k: v.to(device) for k, v in batch.items()}
            outputs = model(**batch)
            loss = outputs.loss

            loss.backward()
            optimizer.step()
            optimizer.zero_grad()
            total_train_loss += loss.item()

            if (step + 1) % 20 == 0 or (step + 1) == len(train_loader):
                print(f"[Batch {step + 1}/{len(train_loader)}] Train Loss: {loss.item():.4f}")

        avg_train_loss = total_train_loss / len(train_loader)
        print(f"Average Train Loss: {avg_train_loss:.4f}")

        model.eval()
        total_val_loss = 0
        with torch.no_grad():
            for step, batch in enumerate(val_loader):
                batch = {k: v.to(device) for k, v in batch.items()}
                val_loss = model(**batch).loss.item()
                total_val_loss += val_loss

                if (step + 1) % 10 == 0 or (step + 1) == len(val_loader):
                    print(f"[Val Batch {step + 1}/{len(val_loader)}] Val Loss: {val_loss:.4f}")

        avg_val_loss = total_val_loss / len(val_loader)
        print(f"Average Val Loss: {avg_val_loss:.4f}")

    torch.save(model.state_dict(), save_path)
    print(f"\n‚úÖ Model saved to {save_path}")

# ======================= Inference & Postprocessing ========================
from difflib import get_close_matches
import re

def apply_postprocessing(pred_sql, question, db_id, schema_dict):
    # Extract schema info
    tables = list(schema_dict[db_id]['columns'].keys())
    columns = [col for cols in schema_dict[db_id]['columns'].values() for col in cols]

    # 1. COLUMN/TABLE NAME CORRECTION
    def correct_names(text, valid_names):
        tokens = set(re.findall(r'\b\w+\b', text))
        for token in tokens:
            match = get_close_matches(token, valid_names, n=1, cutoff=0.85)
            if match and token != match[0]:
                text = re.sub(rf'\b{re.escape(token)}\b', match[0], text, flags=re.IGNORECASE)
        return text

    pred_sql = correct_names(pred_sql, tables + columns)

    # 2. TABLE ALIAS CORRECTION
    aliases = {}
    alias_matches = re.findall(r'(FROM|JOIN)\s+(\w+)\s+AS\s+(\w+)', pred_sql, re.IGNORECASE)
    for _, table, alias in alias_matches:
        aliases[alias] = table

    for alias, table in aliases.items():
        if table in schema_dict[db_id]['columns']:
            valid_cols = [col for col in schema_dict[db_id]['columns'][table]]
            for col in valid_cols:
                wrong_pattern = rf'\b{alias}\d*\.{col}\b'
                correct_pattern = f'{alias}.{col}'
                pred_sql = re.sub(wrong_pattern, correct_pattern, pred_sql)

    # 3. REPLACING <unk> WITH < OR >
    if '<unk>' in pred_sql:
        comparative_less = {"less", "smaller", "fewer", "below", "under"}
        comparative_more = {"more", "greater", "higher", "above", "over"}

        question_tokens = question.lower().split()
        unk_match = re.search(r'(\w+)\s*<unk>', pred_sql)
        if unk_match:
            col_name = unk_match.group(1)
            col_tokens = col_name.lower().split('_')
            position = -1
            for i in range(len(question_tokens) - len(col_tokens) + 1):
                if question_tokens[i:i + len(col_tokens)] == col_tokens:
                    position = i
                    break

            context_window = question_tokens[max(0, position-2):position+len(col_tokens)+2]
            if any(word in comparative_less for word in context_window):
                pred_sql = pred_sql.replace('<unk>', '<')
            elif any(word in comparative_more for word in context_window):
                pred_sql = pred_sql.replace('<unk>', '>')
            else:
                pred_sql = pred_sql.replace('<unk>', '<')  # default fallback

    # 4. CLEANUP
    pred_sql = pred_sql.replace('<pad>', '').replace('</s>', '').replace('<s>', '').strip()
    if not pred_sql.endswith(';'):
        pred_sql += ';'

    return pred_sql

def generate_predictions(model_path, data_path, output_path="/kaggle/working/predictions.json"):
    print("\nüîç Running inference and post-processing...")
    device = torch.device("cuda" if torch.cuda.is_available() else "cpu")

    tokenizer = T5Tokenizer.from_pretrained("t5-base")
    tokenizer.add_tokens(["<schema>"])

    model = T5ForConditionalGeneration.from_pretrained("t5-base")
    model.resize_token_embeddings(len(tokenizer))
    model.load_state_dict(torch.load(model_path, map_location=device))
    model.to(device)
    model.eval()

    _, dev_data, tables = load_spider_data(data_path)
    schema_dict = get_schema_dict(tables)
    #schema_dict = build_schema_dict(tables)

    results = []

    for ex in tqdm(dev_data):
        question = ex["question"]
        db_id = ex["db_id"]
        schema = schema_dict[db_id]
        schema_str = serialize_schema(db_id, schema_dict)

        input_text = f"translate English to SQL: {question} <schema> {schema_str}"
        input_ids = tokenizer.encode(input_text, return_tensors="pt", truncation=True).to(device)

        output_ids = model.generate(input_ids, max_length=128)
        pred = tokenizer.decode(output_ids[0], skip_special_tokens=False)
        #fixed_pred = postprocess_prediction(pred, question, schema)
        fixed_pred = apply_postprocessing(pred, question, db_id, schema_dict)

        results.append({"db_id": db_id, "query": fixed_pred})

    with open(output_path, 'w') as f:
        json.dump(results, f, indent=2)

    print(f"\n‚úÖ Predictions saved to {output_path}")


# ======================= Main ============================
def main():
    data_path = "/kaggle/input/spider-data/spider_data/"
    model_path = "/kaggle/input/spider-data/t5_text2sql_final.pt"


    """
    print("Loading and preparing data...")
    train_data, dev_data, tables = load_spider_data(data_path)
    train_data, val_data = split_train_val(train_data)
    schema_dict = get_schema_dict(tables)

    train_pairs = prepare_input_output(train_data, schema_dict)
    val_pairs = prepare_input_output(val_data, schema_dict)

    tokenizer = T5Tokenizer.from_pretrained("t5-base")
    tokenizer.add_tokens(["<schema>"])

    model = T5ForConditionalGeneration.from_pretrained("t5-base")
    model.resize_token_embeddings(len(tokenizer))

    train_loader, val_loader = prepare_dataloaders(train_pairs, val_pairs, tokenizer)

    optimizer = torch.optim.AdamW(model.parameters(), lr=3e-4)
    device = torch.device("cuda" if torch.cuda.is_available() else "cpu")

    print("Starting training...")
    train(model, train_loader, val_loader, optimizer, device, tokenizer, save_path=model_path)
    """
    generate_predictions(model_path, data_path)



if __name__ == "__main__":
    main()

2025-05-10 05:59:21.407499: E external/local_xla/xla/stream_executor/cuda/cuda_fft.cc:477] Unable to register cuFFT factory: Attempting to register factory for plugin cuFFT when one has already been registered
WARNING: All log messages before absl::InitializeLog() is called are written to STDERR
E0000 00:00:1746856761.694057      31 cuda_dnn.cc:8310] Unable to register cuDNN factory: Attempting to register factory for plugin cuDNN when one has already been registered
E0000 00:00:1746856761.777648      31 cuda_blas.cc:1418] Unable to register cuBLAS factory: Attempting to register factory for plugin cuBLAS when one has already been registered

üîç Running inference and post-processing...

spiece.model:   0%|          | 0.00/792k [00:00<?, ?B/s]

tokenizer.json:   0%|          | 0.00/1.39M [00:00<?, ?B/s]

config.json:   0%|          | 0.00/1.21k [00:00<?, ?B/s]

You are using the default legacy behaviour of the <class 'transformers.models.t5.tokenization_t5.T5Tokenizer'>. This is expected, and simply means that the `legacy` (previous) behavior will be used so nothing changes for you. If you want to use the new behaviour, set `legacy=False`. This should only be set if you understand what it means, and thoroughly read the reason why this was added as explained in https://github.com/huggingface/transformers/pull/24565
Xet Storage is enabled for this repo, but the 'hf_xet' package is not installed. Falling back to regular HTTP download. For better performance, install the package with: `pip install huggingface_hub[hf_xet]` or `pip install hf_xet`

model.safetensors:   0%|          | 0.00/892M [00:00<?, ?B/s]

generation_config.json:   0%|          | 0.00/147 [00:00<?, ?B/s]

/tmp/ipykernel_31/3261330113.py:236: FutureWarning: You are using `torch.load` with `weights_only=False` (the current default value), which uses the default pickle module implicitly. It is possible to construct malicious pickle data which will execute arbitrary code during unpickling (See https://github.com/pytorch/pytorch/blob/main/SECURITY.md#untrusted-models for more details). In a future release, the default value for `weights_only` will be flipped to `True`. This limits the functions that could be executed during unpickling. Arbitrary objects will no longer be allowed to be loaded via this mode unless they are explicitly allowlisted by the user via `torch.serialization.add_safe_globals`. We recommend you start setting `weights_only=True` for any use case where you don't have full control of the loaded file. Please open an issue on GitHub for any issues related to this experimental feature.
  model.load_state_dict(torch.load(model_path, map_location=device))
  0%|          | 0/1034 [00:00<?, ?it/s]Asking to truncate to max_length but no maximum length is provided and the model has no predefined maximum length. Default to no truncation.
100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 1034/1034 [10:54<00:00,  1.58it/s]

‚úÖ Predictions saved to /kaggle/working/predictions.json

In [ ]:
print("ho")

In [2]:
import json
import os

# Clone evaluation repo if not already
if not os.path.exists("test-suite-sql-eval"):
    !git clone https://github.com/taoyds/test-suite-sql-eval.git

# 1. Fix the gold file (dev.json)
with open("/kaggle/input/spider-data/spider_data/dev.json") as f:
    gold_raw = json.load(f)

with open("/kaggle/working/fixed_gold.txt", "w") as f:
    for ex in gold_raw:
        gold_query = ex['query'].strip().lower()  # convert to lowercase
        db_id = ex['db_id']
        if(gold_query[-1]!=";"):
            gold_query = gold_query + ";"
        f.write(f"{gold_query}\t{db_id}\n")

# 2. Fix the predictions file (predictions.json)
with open("/kaggle/working/predictions.json") as f:
    pred_raw = json.load(f)

with open("/kaggle/working/fixed_pred.txt", "w") as f:
    for ex in pred_raw:
        pred_query = ex['query'].strip().lower()  # convert to lowercase
        db_id = ex['db_id']
        f.write(f"{pred_query}\t{db_id}\n")

# 3. Check format of fixed_gold.txt
with open("/kaggle/working/fixed_gold.txt") as f:
    for i, line in enumerate(f, 1):
        try:
            parts = line.strip().split("\t")
            if len(parts) != 2:
                print(f"[GOLD] Line {i} is malformed:", parts)
        except Exception as e:
            print(f"[GOLD] Line {i} error:", e)

# 4. Check format of fixed_pred.txt
with open("/kaggle/working/fixed_pred.txt") as f:
    for i, line in enumerate(f, 1):
        try:
            parts = line.strip().split("\t")
            if len(parts) != 2:
                print(f"[PRED] Line {i} is malformed:", parts)
        except Exception as e:
            print(f"[PRED] Line {i} error:", e)

# 5. Run evaluation
!python test-suite-sql-eval/evaluation.py \
  --gold /kaggle/working/fixed_gold.txt \
  --pred /kaggle/working/fixed_pred.txt \
  --db /kaggle/input/spider-data/spider_data/database/ \
  --table /kaggle/input/spider-data/spider_data/tables.json \
  --etype all

Cloning into 'test-suite-sql-eval'...
remote: Enumerating objects: 61, done.
remote: Counting objects: 100% (30/30), done.
remote: Compressing objects: 100% (14/14), done.
remote: Total 61 (delta 21), reused 16 (delta 16), pack-reused 31 (from 1)
Receiving objects: 100% (61/61), 618.38 KiB | 5.62 MiB/s, done.
Resolving deltas: 100% (25/25), done.
medium pred: select avg(age) , min(age) , max(age) from singer where is_male = 'french';
medium gold: select avg(age) ,  min(age) ,  max(age) from singer where country  =  'france';

medium pred: select max(capacity) , avg(average) from stadium;
medium gold: select max(capacity), average from stadium;

medium pred: select name , capacity from stadium order by avg(capacity) desc limit 1;
medium gold: select name ,  capacity from stadium order by average desc limit 1;

medium pred: select name , capacity from stadium order by avg(capacity) desc limit 1;
medium gold: select name ,  capacity from stadium order by average desc limit 1;

extra pred: select t2.name , avg(t1.capacity) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year >= 2014 group by t1.stadium_id order by count(*) desc limit 1;
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >=  2014 group by t2.stadium_id order by count(*) desc limit 1;

hard pred: select country from singer where age > 40 intersect select country from singer where age > 30;
hard gold: select country from singer where age  >  40 intersect select country from singer where age  <  30;

hard pred: select distinct t1.name from stadium as t1 join concert as t2 on t1.stadium_id = t2.stadium_id except select t1.name from stadium as t1 join concert as t2 on t1.stadium_id = t2.stadium_id where t2.year = 2014;
hard gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  =  2014;

medium pred: select t2.theme , t1.name , count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t1.concert_id;
medium gold: select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id;

medium pred: select t2.name , t3.theme , count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id join singer as t3 on t1.song_id = t3.song_id group by t1.song_name;
medium gold: select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id;

medium pred: select t2.name , count(*) from concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t1.singer_id;
medium gold: select t2.name ,  count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id  =  t2.singer_id group by t2.singer_id;

medium pred: select t2.name , count(*) from concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t1.singer_id;
medium gold: select t2.name ,  count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id  =  t2.singer_id group by t2.singer_id;

hard pred: select t2.name from concert as t1 join singer as t2 on t1.singer_id = t2.singer_id where t1.year = 2014;
hard gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id  =  t2.singer_id join concert as t3 on t1.concert_id  =  t3.concert_id where t3.year  =  2014;

hard pred: select t2.name from concert as t1 join singer as t2 on t1.singer_id = t2.singer_id where t1.year = 2014;
hard gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id  =  t2.singer_id join concert as t3 on t1.concert_id  =  t3.concert_id where t3.year  =  2014;

medium pred: select t2.name , t2.country from singer as t1 join singer_in_concert as t2 on t1.singer_id = t2.singer_id where t1.song_name like "%hey%";
medium gold: select name ,  country from singer where song_name like '%hey%';

medium pred: select t2.name , t2.country from singer as t1 join singer_in_concert as t2 on t1.singer_id = t2.singer_id where t1.song_name like "%hey%";
medium gold: select name ,  country from singer where song_name like '%hey%';

hard pred: select count(*) from concert where stadium_id in (select stadium_id from stadium order by capacity desc limit 1);
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1);

hard pred: select count(*) from concert where stadium_id in (select stadium_id from stadium order by capacity desc limit 1);
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1);

easy pred: select count(*) from has_petition as t1 join pets as t2 on t1.petid = t2.petid where t1.weight > 10;
easy gold: select count(*) from pets where weight  >  10;

easy pred: select count(*) from has_pet as t1 join pets as t2 on t1.petid = t2.petid where t2.weight > 10;
easy gold: select count(*) from pets where weight  >  10;

medium pred: select weight from pets order by age limit 1;
medium gold: select weight from pets order by pet_age limit 1;

medium pred: select weight from pets order by weight limit 1;
medium gold: select weight from pets order by pet_age limit 1;

medium pred: select pettype , max(weight) , max(weight) from pets group by pettype;
medium gold: select max(weight) ,  pettype from pets group by pettype;

medium pred: select count(*) from has_petition as t1 join pets as t2 on t1.petid = t2.petid join student as t3 on t1.stuid = t3.stuid where t3.age > 20;
medium gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid where t1.age  >  20;

medium pred: select count(*) from has_petition as t1 join pets as t2 on t1.petid = t2.petid join student as t3 on t1.stuid = t3.stuid where t3.age > 20;
medium gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid where t1.age  >  20;

hard pred: select count(*) from has_petition as t1 join pets as t2 on t1.petid = t2.petid join student as t3 on t1.stuid = t3.stuid where t3.sex = "f";
hard gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t2.petid  =  t3.petid where t1.sex  =  'f' and t3.pettype  =  'dog';

hard pred: select count(*) from has_petition as t1 join pets as t2 on t1.petid = t2.petid join student as t3 on t1.stuid = t3.stuid where t3.sex = "f";
hard gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t2.petid  =  t3.petid where t1.sex  =  'f' and t3.pettype  =  'dog';

extra pred: select fname from student where stuid in (select stuid from has_pet) or pets = "cat";
extra gold: select distinct t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' or t3.pettype  =  'dog';

extra pred: select fname from student where stuid in (select stuid from has_pet) or pets = "cat";
extra gold: select distinct t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' or t3.pettype  =  'dog';

extra pred: select fname from student where stuid in (select stuid from has_pet) intersect select stuid from has_pet where pets = "cat" intersect select stuid from has_pet";
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog';

extra pred: select fname from student where stuid in (select stuid from has_pet) intersect select stuid from has_pet where pets = "cat" intersect select stuid from has_pet";
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog';

extra pred: select major , age from student except select t1.major , t1.age from student as t1 join has_pet as t2 on t1.stuid = t2.stuid where t2.pet_type = "cat";
extra gold: select major ,  age from student where stuid not in (select t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat');

extra pred: select major , age from student where stuid not in (select stuid from has_pet);
extra gold: select major ,  age from student where stuid not in (select t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat');

hard pred: select stuid from student except select stuid from has_petition where pets = "cat";
hard gold: select stuid from student except select t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat';

hard pred: select stuid from student except select stuid from has_pet;
hard gold: select stuid from student except select t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat';

extra pred: select fname , age from student where stuid in (select stuid from has_pet) except select stuid from has_pet where pets = "cat");
extra gold: select t1.fname ,  t1.age from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog' and t1.stuid not in (select t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat');

extra pred: select fname from student where stuid in (select stuid from has_pet) except select fname from has_pet where pets = "cat");
extra gold: select t1.fname ,  t1.age from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog' and t1.stuid not in (select t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat');

medium pred: select pettype , weight from pets order by age limit 1;
medium gold: select pettype ,  weight from pets order by pet_age limit 1;

medium pred: select stuid , weight from pets where pet_age > 1;
medium gold: select petid ,  weight from pets where pet_age  >  1;

medium pred: select stuid , weight from pets where pet_age > 1;
medium gold: select petid ,  weight from pets where pet_age  >  1;

medium pred: select fname , age from student where stuid in (select stuid from has_pet);
medium gold: select distinct t1.fname ,  t1.age from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid;

medium pred: select distinct t1.fname , t1.age from student as t1 join has_pet as t2 on t1.stuid = t2.stuid where t2.pet_age = "pets";
medium gold: select distinct t1.fname ,  t1.age from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid;

medium pred: select stuid from has_petition where lname = "smith";
medium gold: select t2.petid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid where t1.lname  =  'smith';

medium pred: select stuid from has_petition where lname = "smith";
medium gold: select t2.petid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid where t1.lname  =  'smith';

medium pred: select count(*) , stuid from has_pet group by stuid;
medium gold: select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid;

medium pred: select stuid , count(*) from has_pet group by stuid;
medium gold: select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid;

medium pred: select fname , sex from student group by sex having count(*) > 1;
medium gold: select t1.fname ,  t1.sex from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid having count(*)  >  1;

medium pred: select fname , sex from student group by sex having count(*) > 1;
medium gold: select t1.fname ,  t1.sex from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid having count(*)  >  1;

hard pred: select lname from student where stuid in (select stuid from has_pet) and pet_age = 3;
hard gold: select t1.lname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pet_age  =  3 and t3.pettype  =  'cat';

hard pred: select lname from student where stuid in (select stuid from has_pet) and pet_age = 3;
hard gold: select t1.lname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pet_age  =  3 and t3.pettype  =  'cat';

medium pred: select continents , continentname , count(*) from continents group by continents;
medium gold: select t1.contid ,  t1.continent ,  count(*) from continents as t1 join countries as t2 on t1.contid  =  t2.continent group by t1.contid;

medium pred: select contid , continent , count(*) from continents group by contid;
medium gold: select t1.contid ,  t1.continent ,  count(*) from continents as t1 join countries as t2 on t1.contid  =  t2.continent group by t1.contid;

medium pred: select t2.made , t1.made , count(*) from car_names as t1 join model_list as t2 on t1.modelid = t2.modelid group by t1.modelid;
medium gold: select t1.fullname ,  t1.id ,  count(*) from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker group by t1.id;

medium pred: select t1.fullname , t2.made , count(*) from car_makers as t1 join model_list as t2 on t1.id = t2.modelid group by t2.modelid;
medium gold: select t1.fullname ,  t1.id ,  count(*) from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker group by t1.id;

hard pred: select model from cars_data where horsepower = (select min(horsepower) from cars_data);
hard gold: select t1.model from car_names as t1 join cars_data as t2 on t1.makeid  =  t2.id order by t2.horsepower asc limit 1;

hard pred: select model from model_list where model = (select model from cars_data group by model order by horsepower asc limit 1);
hard gold: select t1.model from car_names as t1 join cars_data as t2 on t1.makeid  =  t2.id order by t2.horsepower asc limit 1;

extra pred: select model from model_list where weight < (select avg(weight) from cars_data);
extra gold: select t1.model from car_names as t1 join cars_data as t2 on t1.makeid  =  t2.id where t2.weight  <  (select avg(weight) from cars_data);

extra pred: select model from model_list where weight < (select avg(weight) from cars_data);
extra gold: select t1.model from car_names as t1 join cars_data as t2 on t1.makeid  =  t2.id where t2.weight  <  (select avg(weight) from cars_data);

extra pred: select t2.made from cars as t1 join car_makers as t2 on t1.madeid = t2.madeid where t1.year = 1970;
extra gold: select distinct t1.maker from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker join car_names as t3 on t2.model  =  t3.model join cars_data as t4 on t3.makeid  =  t4.id where t4.year  =  '1970';

extra pred: select distinct t2.made from cars as t1 join car_names as t2 on t1.id = t2.madeid where t1.year = 1970;
extra gold: select distinct t1.maker from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker join car_names as t3 on t2.model  =  t3.model join cars_data as t4 on t3.makeid  =  t4.id where t4.year  =  '1970';

extra pred: select t1.made , t1.product t2.time from cars as t1 join cars_data as t2 on t1.modelid = t2.modelid order by t2.year limit 1;
extra gold: select t2.make ,  t1.year from cars_data as t1 join car_names as t2 on t1.id  =  t2.makeid where t1.year  =  (select min(year) from cars_data);

extra pred: select maker , year from car_makers order by year asc limit 1;
extra gold: select t2.make ,  t1.year from cars_data as t1 join car_names as t2 on t1.id  =  t2.makeid where t1.year  =  (select min(year) from cars_data);

hard pred: select distinct model from cars_data where year > 1980;
hard gold: select distinct t1.model from model_list as t1 join car_names as t2 on t1.model  =  t2.model join cars_data as t3 on t2.makeid  =  t3.id where t3.year  >  1980;

hard pred: select distinct model from model_list where year > 1980;
hard gold: select distinct t1.model from model_list as t1 join car_names as t2 on t1.model  =  t2.model join cars_data as t3 on t2.makeid  =  t3.id where t3.year  >  1980;

hard pred: select continent , count(*) from cars group by continent;
hard gold: select t1.continent ,  count(*) from continents as t1 join countries as t2 on t1.contid  =  t2.continent join car_makers as t3 on t2.countryid  =  t3.country group by t1.continent;

hard pred: select continent , count(*) from cars group by continent;
hard gold: select t1.continent ,  count(*) from continents as t1 join countries as t2 on t1.contid  =  t2.continent join car_makers as t3 on t2.countryid  =  t3.country group by t1.continent;

extra pred: select countryname from manufacturers group by countryname order by count(*) desc limit 1;
extra gold: select t2.countryname from car_makers as t1 join countries as t2 on t1.country  =  t2.countryid group by t1.country order by count(*) desc limit 1;

extra pred: select countryname from countries group by countryname order by count(*) desc limit 1;
extra gold: select t2.countryname from car_makers as t1 join countries as t2 on t1.country  =  t2.countryid group by t1.country order by count(*) desc limit 1;

medium pred: select maker , count(*) from car_modellers group by maker;
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

medium pred: select t1.id , t1.fullname from car_makers as t1 join model_list as t2 on t1.id = t2.makeid group by t1.id;
medium gold: select count(*) ,  t2.fullname ,  t2.id from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

medium pred: select accelerate from cars_data where mpg = "ac hornet sportabout";
medium gold: select t1.accelerate from cars_data as t1 join car_names as t2 on t1.id  =  t2.makeid where t2.make  =  'amc hornet sportabout (sw)';

medium pred: select accelerate from cars_data where edispl = "amc hornet sportabout";
medium gold: select t1.accelerate from cars_data as t1 join car_names as t2 on t1.id  =  t2.makeid where t2.make  =  'amc hornet sportabout (sw)';

medium pred: select count(*) from car_makers where country = "france";
medium gold: select count(*) from car_makers as t1 join countries as t2 on t1.country  =  t2.countryid where t2.countryname  =  'france';

medium pred: select count(*) from manufacturers where countryname = "france";
medium gold: select count(*) from car_makers as t1 join countries as t2 on t1.country  =  t2.countryid where t2.countryname  =  'france';

hard pred: select count(*) from model_list;
hard gold: select count(*) from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id join countries as t3 on t2.country  =  t3.countryid where t3.countryname  =  'usa';

hard pred: select count(*) from models as t1 join model_list as t2 on t1.modelid = t2.modelid join countries as t3 on t2.countryid = t3.countryid;
hard gold: select count(*) from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id join countries as t3 on t2.country  =  t3.countryid where t3.countryname  =  'usa';

easy pred: select avg(mpg) , avg(mpg) from cars_data where cylinders = 4;
easy gold: select avg(mpg) from cars_data where cylinders  =  4;

easy pred: select avg(t2.miles_per-gall) from cars_data as t1 join cards as t2 on t1.car_id = t2.car_id where t1.cylinders = 4;

In [29]:
#!git clone https://github.com/taoyds/spider.git

!python spider/evaluation.py \
  --gold /kaggle/input/spider-data/spider_data/dev.json \
  --pred /kaggle/working/predictions.json \
  --db /kaggle/input/spider-data/spider_data/database/ \
  --table /kaggle/input/spider-data/spider_data/tables.json

usage: evaluation.py [-h] [--gold GOLD] [--pred PRED] [--db DB] [--table TABLE]
                     [--etype {all,exec,match}] [--plug_value] [--keep_distinct]
                     [--progress_bar_for_each_datapoint]
evaluation.py: error: unrecognized arguments: ¬†¬†--etype¬†all